---
kind: method
id: M:Autodesk.Revit.DB.FamilyInstance.flipHand
zh: 族实例
source: html/c31b55a1-ce2e-a86c-ede0-21a883e7d4e4.htm
---
# Autodesk.Revit.DB.FamilyInstance.flipHand Method

**中文**: 族实例

The orientation of family instance hand will be flipped. If it can not be flipped, return false, otherwise return true.

## Syntax (C#)
```csharp
public bool flipHand()
```